'''
โครงสร้างควบคุม (control structure)
1.แบบลำดับ
2.แบบเลือก
3.แบบทำซ้ำ

if expression เวลาให้ if จะใช้ boolean มารวมด้วย
    statment คำสั้งเมือเข้าเงือนไข
'''
age=int(input("กรุณาป้อนอายุ : "))
#เวลาจะทำการเขียน statment ใต้ if จะต้องเว้นช้องด้านหน้าไว้ด้วย
#เพื่อให้โปรแกรมรู้ว่าชุดคำสั่งนี้อยู่ในชุดคำสั่ง if
#if จะทำงานเมื่อเป็นจริงเท่านั้น
#สามารถใช้ and or not ร่วมได้
if age>=15 and age<=20:
    print("วันรุ่น")
elif age>=20 and age<=30:
    print("วัยหนุ่มสาว")
elif age>=30 and age<40:
    print("วันผู้ใหญ่")
else :
    print("อายูต่ำกว่าเกณฑ์")
print("END")
