#เจาะลึกการใช้ string
# ' จะใช้กับข้อความตัวอักษร
# "" จะใช้กับข้อความยาวๆ
'''คำสั่งที่ 1'''
# [] เครื่องหมายก้ามปู หรือ brackets ใช้ระบุindex หรือตำแหน่ง
# index คือช่องตัวอักษรในข้อความนั้นๆโดยนับจาก 0 ถึง N เริ่มนับตั้งแต่ตัวแรก เช่น thongtae ตัว t เป็นช่องที่ 0 ตัว g เป็นช่องที่ 4  
name="thongtae"
print(name[0]) # แบบดึงตัวอักษรตัวเดียว
#แบบดึงหลายตัวแต่ต้องกำหนดให้เกินไป1ตัวเพราะโปรแกรมจะแสดงถึงแค่ก่อนตัวสุดท้าย
#เช่น ถ้าจะให้ออกเป็น thong จะต้องกำหนด 0ถึง4 แต่โปรแกรมหยุดที่ n 
#เพราะฉะนั้นต้องกำหนดเกินมา1ตัว คือ 0ถึง5 จะออกเป็น thong
print(name[0:5])
print(name[-1]) #ถ้าจะเริ่มจากข้างหลังให้ใส่เครื่องหมายลบ
'''คำสั่งที่ 2 '''
#ถ้าจะเช็คความยาว string โดยใช้คำสั่ง len
print(len(name)) #เช็คแล้วมีความยาว 8 ตัว
'''คำสั่งที่ 3 '''
#ในกรณีที่ชื่อเรามีช่องว่าง ซ้ายขวาเราสามารถ ใช้คำสั่ง strip ลบได้เช่น
#ถ้าจะลบเฉพาะ ซ้าย หรือ ขวา ให้เติม l หรือ r ด้านหน้า strip เพื่อระบุว่าซ้ายหรือขวา
name2="  thongtae  "
print(len(name2))
name2=name.strip()
print(len(name2))
'''คำสั่งที่ 4 '''
#การแปลง case ของ string จากพิมย์เล็กเป็นพิมย์ใหญ่
#โดยใช้คำสั่ง upper แปลงเป็นตัวพิมย์เล็กเป็นตัวพิมย์
#ใช้คำสั่ง lower แปลงตัวพิมย์ใหญ่เป็นตัวพิมเย์ล็ก
#แล้วถ้าจะเปลี่ยนเฉพาะตัวแรกเป็นตัวพิมย์ใหญ่ใช้คำสั่ง capitalize
print(name.upper())
print(name.capitalize())
'''คำสั่งที่ 5 '''
#คำสั่งแทนที่ replace คือมันจะแทนที่คำเก่าของเราเป็นคำใหม่ในประโยคนั้น
#โครงสร้าง replace("คำเก่า","คำใหม่")
print(name.replace("tae","siri"))
#แต่ถ้าในประโยตของเรามีตัวซ้ำกัน 2 ตัวขึ้นไปเราสามารถกำหนดจำตัวที่เราจะเปลี่ยนได้โดยเพิ่มจำนวณตามหลัง
print(name.replace("t","d",2))
'''คำสั่งที่ 6'''
#การเช็คข้อความ คือ จะเช็คว่ามีข้ออยู๋ในประโยคนั้นหรือป่าว โดยใช้คำสั่ง in โดยมีค่าเป็น ture กับ false เช่น

x = "thong" in name
if x:
    name=name.replace("t","d",1)
print(name)



