'''คำสั่งที่ 7 '''
#การต่อ string (concatinate) โดยใช้ + 
#ตัวอย่าง
firstname="thongtae"
lastname="sirimak"
age="20"
salary=15000.5156
fullname=firstname+lastname+age
print(fullname)
#หรือเขียนแบบรวบรัด
print("ชื่อต้น:"+firstname+"\tนามสกุล:"+lastname+"\tอายุ:"+age)
'''คำสั่งที่ 8 '''
#การจัดรูปแบบการแสดงผล และใช้ {} และคำสั่ง format
#{} ตัวนี้จะเป็นบล็อกที่จะเอาตัวแปลมาใส่ลงไป
#คำสั่ง format เป็นที่จะระบุตัวแปลลงไปในบล็อกปีกกา
#การใส่จะแปลจะเรียงลำดับจากซ้ายไปขวาจาก 0 ถึง n  หรือจะใส่ตัวเลขลงไปในบล็อกปีกกาก็ได้แต่ลำดับจะเรียงจากตัวแปลที่ใส่ใน format
#ถ้าเป็นรูปแบบนี้ใส่ ข้อมูลแบบ int ได้เลย 
#ถ้าจะจำกัดตัวเลขทศนิยมให้เขียน .2f คือเอาแค่2ตำแหน่งหรือ3ตำแหน่งก็ .3f
text="=ชื่อต้น:{0} \tนามสกุล:{1} \tอายุ:{2} \tเงินเดือน:{3:.2f}"
print(text.format(firstname,lastname,age,salary))

'''คำสั่งที่ 9 '''
#นับจำนวณคำในประโยค ใช้คำสั่ง count
x="a a b c d r a"
print(x.count("a")) 
#จะนับจำนวณ a ในประโยค

'''คำสั่งที่ 10 '''
#เช็คคำขึ้นต้น ใช้คำสั่ง startswith
#เช็คคำลงท้าย ใช้คำสั่ง endswith
name1="นายทองแท้"
print(name1.startswith("นาย"))

if name1.startswith("นาย"):
    print("เพศชาย")
else:
    print("เพศหญิง")