#ชนิดข้อมูลแบบ string ที่เป็นชนิดข้อมูลที่จัดการเกี่ยวกับ ข้อความตัวอักษร ใช้ได้ทั้ง ' "" '''
'''
Print สามารถแสดง ตัวเลขได้ทั้งจำนวนเต็มและทศนิยม 
(ถ้าจะให้แสดงเป็นตัวเลขเลยไม่ตhองใส่ ' ""  แต่ถ้าใส่เป็นตังเลข 1+1 จะไม่ออกข้อความเป็น 1+1 แต่จะเป็นผลลัพคือ2แทน)
แต่ถ้าจะให้เป็นข้อความให้ ""
'''

#\n คือ ขึ้นบรรทัดใหม่
#\t คือ เว้นช่องว่าง หรือ Tab
print("Hello wold")
#เครื่องหมาย + ในชนิดข้อมูลแบบ string คือการนำข้อความมาต่อกัน
print("Hello" + "Top")
#ใส่ \t จะ Tab คำว่า top ออกไป
print("Hello \t" + "Top")