#Type coversion การแปลงข้อมูล
#เวลาเราจะใช้ข้อมูลรว่มกันแต่ชนิดข้อมูลแตกต่างกันเราจะต้องแปลงข้อมูลห้ตรงกันก่อนไม่งั้นโปรแกรมจะไม่สามารถทำงานได้
#แต่จะมีบ้างอย่างใช้ร่วมกันได้ int+float เพราะเป็นตัวเลขเหมือนกันแต่ทั้งสองอย่างจะใช้กับ str ไม่ได้เพราะเป็นตัวอักษร
#ตัวอย่าง
x = 10 
y = 3.14
z = "20"
#การบวกเลย
#result = x+y ผลลัพธ์ที่ได้จะเป็น 10+3.14 = 13.14 ไม่ต้องแปลงค่าอะไรเพราะเป็นตัวเลขเหมือนกัน
#กลับกันหาเอา x+z จะไม่สามารถบวกกันได้เพราะ z เป็นชนิดข้อมูลตัวอักษรจังไม่สามารถบวกกับตัวเลขได้
#การแปลงข้อมูลเราจะกำหนดข้อมูลที่เราจะแปลงไว้ด้านหน้าและต้องด้วยค่าที่เราจะแปลง
#เช่น เราจะแปลง z เป็นข้อมูลชนิดตัวเลข int(z) ตอนนี้ z เราก็จะเป็นข้อมูลชนิดตัวเลขแล้ว
#result = x+int(z) ผลลัพธ์ที่ได้คือ 10+20 = 30 
# แต่ถ้าเราเอา str มาบวกกัน ผลลัพธ์ ที่ได้จะเป็นการต่อกันของข้อความแทน
# ตัวอย่าง  result = str(x)+z ผลลัพธ์ที่ได้คือ 1020 
#ถ้าเราจะแปลงเลขทศนิยม(float)เป็นเลขจำนวนเต็ม(int)เลขที่ได้มันจะตัดเลยทศนิยมออกไป
#ตัวอย่าง y=int(y) ผลลัพธ์ที่ได้ จาก 3.14 ไปเป็น 3 
#แลัวถ้าแปลงเลขจำนวนเต็มเป็ฯทศนิยม x=float(x) ผลลัพธ์ที่ได้ จาก 10 ไปเป็น 10.0
#ในกรณีของ print ก็เช่นกัน
#ทำไมถึงต้องแปลงชนิดข้อมูลก่อนเพราะการแสดงผลของ string ไม่สามารถต่อด้วย int ได้จึงต้องแปลง int เป็น str 
print("ผลลัพธ์ = "+str(x))